# Pandas Basics 
<hr
style="borders:2.5px solid 
#000000ff">
</hr>

<b>Krizzia Jenna H. Peregrina</b>
<br>Computer Engineer

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# DataFrame

In [5]:
data = {
    "Name":['Krizzia', 'Jenna', 'Xiao'],
    "Age":[19, 20, 21],
    "Sex":['F', 'F', 'M']
}

In [7]:
df = pd.DataFrame(data)
df

      Name  Age Sex
0  Krizzia   19   F
1    Jenna   20   F
2     Xiao   21   M

# Series

In [8]:
df['Name']

0    Krizzia
1      Jenna
2       Xiao
Name: Name, dtype: object

In [9]:
df['Age']

0    19
1    20
2    21
Name: Age, dtype: int64

In [10]:
df['Sex']

0    F
1    F
2    M
Name: Sex, dtype: object

# Descriptive Statistics

In [11]:
resistance = np.array([
    [10.6,9.1,9.3,9.8,10.5,10.4,9.5,11,10.4,3,9.8],
    [10.1,11,9.1,20,9.2,10.8,9.9,9.2,9.1,9.1,np.nan]
]).T
resistance

array([[10.6, 10.1],
       [ 9.1, 11. ],
       [ 9.3,  9.1],
       [ 9.8, 20. ],
       [10.5,  9.2],
       [10.4, 10.8],
       [ 9.5,  9.9],
       [11. ,  9.2],
       [10.4,  9.1],
       [ 3. ,  9.1],
       [ 9.8,  nan]])

In [12]:
df = pd.DataFrame(resistance, columns=['Jaguar', 'Panther'])
df

    Jaguar  Panther
0     10.6     10.1
1      9.1     11.0
2      9.3      9.1
3      9.8     20.0
4     10.5      9.2
5     10.4     10.8
6      9.5      9.9
7     11.0      9.2
8     10.4      9.1
9      3.0      9.1
10     9.8      NaN

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Jaguar   11 non-null     float64
 1   Panther  10 non-null     float64
dtypes: float64(2)
memory usage: 308.0 bytes

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.describe()

          Jaguar    Panther
count  11.000000  10.000000
mean    9.400000  10.750000
std     2.204541   3.329081
min     3.000000   9.100000
25%     9.400000   9.125000
50%     9.800000   9.550000
75%    10.450000  10.625000
max    11.000000  20.000000